In [10]:
import numpy as np
import pandas as pd
import seaborn as sns
#import matplotlib.pyplot as plt

In [140]:
df = sns.load_dataset('titanic')

In [142]:
#df.fillna({'age':30}, inplace=True)
df['age'] = df['age'].fillna(30)

In [144]:
df['age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [146]:
assert df['age'].isnull().sum() == 0
assert df['age'].mean().round(4) == 29.7589

In [210]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [212]:
is_male = (df['sex'] == 'male')
is_female = (df['sex'] == 'female')

male_age = df.loc[is_male, 'age'].mean()
female_age = df.loc[is_female, 'age'].mean()

print(m_mean)
print(w_mean)

df.loc[is_male, 'age'] = df.loc[is_male, 'age'].fillna(male_age) 
df.loc[is_female, 'age'] = df.loc[is_female, 'age'].fillna(female_age)

31.252404354157136
28.605095541401273

In [214]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [218]:
# df['age'].isnull().sum()
# df['age'].mean().round(5)

assert (df['age'].isnull().sum() == 0)
assert df['age'].mean().round(5) == 29.73603